Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

In [4]:
da=[1,3,4,5,6,4,3,4,2,4,5,6,2]

In [5]:
da

[1, 3, 4, 5, 6, 4, 3, 4, 2, 4, 5, 6, 2]

In [6]:
pd.Categorical(da)

[1, 3, 4, 5, 6, ..., 2, 4, 5, 6, 2]
Length: 13
Categories (6, int64): [1, 2, 3, 4, 5, 6]

In [7]:
min(da)

1

In [8]:
max(da)

6

In [9]:
len(da)

13

In [10]:
da.append(77)

In [11]:
da

[1, 3, 4, 5, 6, 4, 3, 4, 2, 4, 5, 6, 2, 77]

In [12]:
da.pop(7)

4

In [13]:
da.pop(3)

5

In [14]:
da

[1, 3, 4, 6, 4, 3, 2, 4, 5, 6, 2, 77]

In [15]:
da.sort()

In [16]:
da

[1, 2, 2, 3, 3, 4, 4, 4, 5, 6, 6, 77]

In [17]:
da

[1, 2, 2, 3, 3, 4, 4, 4, 5, 6, 6, 77]

In [18]:
da.remove(77)

In [19]:
da

[1, 2, 2, 3, 3, 4, 4, 4, 5, 6, 6]

In [20]:
da.reverse()

In [21]:
da

[6, 6, 5, 4, 4, 4, 3, 3, 2, 2, 1]

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [23]:
import pandas as pd

In [24]:
data ={'A':[2,3,4,6,7,8,3,2],
       'B':[4,2,3,5,7,5,1,4],
       'C':[3,2,7,5,9,7,5,4,]}

In [25]:
pd.DataFrame(data)

   A  B  C
0  2  4  3
1  3  2  2
2  4  3  7
3  6  5  5
4  7  7  9
5  8  5  7
6  3  1  5
7  2  4  4

In [26]:
pd.DataFrame(data,index=[1,2,3,4,5,6,7,8])

   A  B  C
1  2  4  3
2  3  2  2
3  4  3  7
4  6  5  5
5  7  7  9
6  8  5  7
7  3  1  5
8  2  4  4

In [27]:
df= pd.DataFrame

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [29]:
data1={'Age':[88,71,42,15,77,22,95,67,4,3,2,1,44,333,222,2,3,44,4,454,55,]


}

In [30]:
pd.DataFrame(data1)

    Age
0    88
1    71
2    42
3    15
4    77
5    22
6    95
7    67
8     4
9     3
10    2
11    1
12   44
13  333
14  222
15    2
16    3
17   44
18    4
19  454
20   55

In [31]:
da = pd.DataFrame(data1)

In [32]:
da[0:3]

   Age
0   88
1   71
2   42

In [33]:
ds=da[0:3]

In [34]:
ds['Age'].sum()

201

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
    'Word_Count' that contains the number of words in each row of the 'Text' column.

In [36]:
data2 = {'Text':['sudhir','rotih','jani','bhai','yaar','body','pagal','me_pagal']

}

In [37]:
pd.DataFrame(data2)

       Text
0    sudhir
1     rotih
2      jani
3      bhai
4      yaar
5      body
6     pagal
7  me_pagal

In [38]:
daa=pd.DataFrame(data2)

In [39]:
daa.apply(len)

Text    8
dtype: int64

In [40]:
daa['Word_Count'] =daa['Text'].apply(len)

In [41]:
daa

       Text  Word_Count
0    sudhir           6
1     rotih           5
2      jani           4
3      bhai           4
4      yaar           4
5      body           4
6     pagal           5
7  me_pagal           8

In [44]:
daa.size

16

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
DataFrame.size-
              Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

In [45]:
daa

       Text  Word_Count
0    sudhir           6
1     rotih           5
2      jani           4
3      bhai           4
4      yaar           4
5      body           4
6     pagal           5
7  me_pagal           8

In [46]:
daa.size

16

In [ ]:
DataFrame.shape-
                  Returns tuple of shape (Rows, columns) of dataframe/series

In [51]:
daa

       Text  Word_Count
0    sudhir           6
1     rotih           5
2      jani           4
3      bhai           4
4      yaar           4
5      body           4
6     pagal           5
7  me_pagal           8

In [50]:
daa.shape

(8, 2)

Q6. Which function of pandas do we use to read an excel file?

In [54]:
pd.read_csv("C:\Users\sudhi\Downloads\nba.csv")

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (3677363419.py, line 1)

In [57]:
pd.read_csv("nba.csv")

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,06-Feb,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,06-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,06-May,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,06-May,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,06-Oct,231,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41,PF,20,06-Oct,234,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8,PG,26,06-Mar,203,Butler,2433333.0
454,Raul Neto,Utah Jazz,25,PG,24,06-Jan,179,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21,C,26,07-Mar,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,7-0,231,Kansas,947276.0

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [1]:
import pandas as pd

In [36]:
pd.DataFrame({'Email': ['sudhirsinghlodhi@email.com',
                      'rohitsinghlodhi@email.com',
                       'bhai@email.com' ,
                       'jani@email.com',
                       'sudhasinghlodhi@email.com']})

                        Email
0  sudhirsinghlodhi@email.com
1   rohitsinghlodhi@email.com
2              bhai@email.com
3              jani@email.com
4   sudhasinghlodhi@email.com

In [37]:
data=pd.DataFrame({'Email': ['sudhirsinghlodhi@email.com',
                      'rohitsinghlodhi@email.com',
                       'bhai@email.com' ,
                       'jani@email.com',
                       'sudhasinghlodhi@email.com']})

In [38]:
data

                        Email
0  sudhirsinghlodhi@email.com
1   rohitsinghlodhi@email.com
2              bhai@email.com
3              jani@email.com
4   sudhasinghlodhi@email.com

In [39]:
data1=pd.DataFrame({'Email1':['sudhirsinghlodhi',
                      'rohitsinghlodhi',
                       'bhai' ,
                       'jani',
                       'sudha']})

In [40]:
data1

             Email1
0  sudhirsinghlodhi
1   rohitsinghlodhi
2              bhai
3              jani
4             sudha

In [41]:
data['Username'] = data1

In [42]:
data

                        Email          Username
0  sudhirsinghlodhi@email.com  sudhirsinghlodhi
1   rohitsinghlodhi@email.com   rohitsinghlodhi
2              bhai@email.com              bhai
3              jani@email.com              jani
4   sudhasinghlodhi@email.com             sudha

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:
    
    
    A B C
0   3 5 1
1   8 2 7
2   6 9 4
3   2 3 5
4   9 1 2
    
    
Your function should select the following rows: A B C    
    
    
1   8 2 7
4   9 1 2  

The function should return a new DataFrame that contains only the selected rows.

In [72]:
pd.DataFrame({'A':[7,8,6,9,10,17,18,14],
              'B':[1,5,7,9,6,4,3,2],
              'C':[88,71,42,15,77,22,95,67]






})

    A  B   C
0   7  1  88
1   8  5  71
2   6  7  42
3   9  9  15
4  10  6  77
5  17  4  22
6  18  3  95
7  14  2  67

In [73]:
daa=pd.DataFrame({'A':[7,8,6,9,10,17,18,14],
                  'B':[1,5,7,9,6,4,3,2],
                  'C':[88,71,42,15,77,22,95,67]})

In [74]:
import pandas as pd

In [75]:
daa

    A  B   C
0   7  1  88
1   8  5  71
2   6  7  42
3   9  9  15
4  10  6  77
5  17  4  22
6  18  3  95
7  14  2  67

In [76]:
daa[1::3]

    A  B   C
1   8  5  71
4  10  6  77
7  14  2  67

In [77]:
daa[0:4]

   A  B   C
0  7  1  88
1  8  5  71
2  6  7  42
3  9  9  15

In [78]:
daa[1::2]

    A  B   C
1   8  5  71
3   9  9  15
5  17  4  22
7  14  2  67

In [79]:
daa[1:1:2]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [80]:
daa[1:3:3]

   A  B   C
1  8  5  71

In [86]:
daa[['A','C']]

    A   C
0   7  88
1   8  71
2   6  42
3   9  15
4  10  77
5  17  22
6  18  95
7  14  67

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [112]:
pd.DataFrame({'Values':[7,8,6,9,10,17,18,14]})

   Values
0       7
1       8
2       6
3       9
4      10
5      17
6      18
7      14

In [113]:
s=pd.DataFrame({'Values':[7,8,6,9,10,17,18,14]})

In [114]:
s

   Values
0       7
1       8
2       6
3       9
4      10
5      17
6      18
7      14

In [118]:
s['Values'].mean()

11.125

In [119]:
s['Values'].median()

9.5

In [121]:
s['Values']

0     7
1     8
2     6
3     9
4    10
5    17
6    18
7    14
Name: Values, dtype: int64

In [123]:
s['Values'].sum()

11.125

In [124]:
s['Values'].sum()/8

11.125

In [125]:
s

   Values
0       7
1       8
2       6
3       9
4      10
5      17
6      18
7      14

In [141]:
s['Values'].median()

9.5

In [134]:
 a=s['Values'][3]

In [135]:
b= s['Values'][4]

In [139]:
q=a+b

In [140]:
q/2

9.5

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [2]:
import pandas as pd

In [4]:
data=pd.date_range(start = '2023-04-1',end = '2023-04-7')

DatetimeIndex(['2023-04-01', '2023-04-02', '2023-04-03', '2023-04-04',
               '2023-04-05', '2023-04-06', '2023-04-07'],
              dtype='datetime64[ns]', freq='D')

In [5]:
data=pd.date_range(start = '2023-04-1',end = '2023-04-7')

In [6]:
pd.DataFrame(data)

           0
0 2023-04-01
1 2023-04-02
2 2023-04-03
3 2023-04-04
4 2023-04-05
5 2023-04-06
6 2023-04-07

In [7]:
data1 = pd.DataFrame(data)

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [24]:
pd.date_range(start = '2023-01-15',end = '2023-01-21')

DatetimeIndex(['2023-01-15', '2023-01-16', '2023-01-17', '2023-01-18',
               '2023-01-19', '2023-01-20', '2023-01-21'],
              dtype='datetime64[ns]', freq='D')

In [22]:
data =pd.date_range(start = '2023-01-15',end = '2023-01-21')

In [23]:
pd.DataFrame(data)

           0
0 2023-01-15
1 2023-01-16
2 2023-01-17
3 2023-01-18
4 2023-01-19
5 2023-01-20
6 2023-01-21

In [25]:
da= pd.DataFrame({'date':data})

In [26]:
da

        date
0 2023-01-15
1 2023-01-16
2 2023-01-17
3 2023-01-18
4 2023-01-19
5 2023-01-20
6 2023-01-21

In [27]:
da ['Weekday']= da['date'].dt.day_name()

In [28]:
da

        date    Weekday
0 2023-01-15     Sunday
1 2023-01-16     Monday
2 2023-01-17    Tuesday
3 2023-01-18  Wednesday
4 2023-01-19   Thursday
5 2023-01-20     Friday
6 2023-01-21   Saturday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [49]:
pd.date_range(start='2023-01-01 7:18:1',end ='2023-01-31  2:8:19')

DatetimeIndex(['2023-01-01 07:18:01', '2023-01-02 07:18:01',
               '2023-01-03 07:18:01', '2023-01-04 07:18:01',
               '2023-01-05 07:18:01', '2023-01-06 07:18:01',
               '2023-01-07 07:18:01', '2023-01-08 07:18:01',
               '2023-01-09 07:18:01', '2023-01-10 07:18:01',
               '2023-01-11 07:18:01', '2023-01-12 07:18:01',
               '2023-01-13 07:18:01', '2023-01-14 07:18:01',
               '2023-01-15 07:18:01', '2023-01-16 07:18:01',
               '2023-01-17 07:18:01', '2023-01-18 07:18:01',
               '2023-01-19 07:18:01', '2023-01-20 07:18:01',
               '2023-01-21 07:18:01', '2023-01-22 07:18:01',
               '2023-01-23 07:18:01', '2023-01-24 07:18:01',
               '2023-01-25 07:18:01', '2023-01-26 07:18:01',
               '2023-01-27 07:18:01', '2023-01-28 07:18:01',
               '2023-01-29 07:18:01', '2023-01-30 07:18:01'],
              dtype='datetime64[ns]', freq='D')

In [50]:
da = pd.date_range(start='2023-01-01 7:18:1',end ='2023-01-31  2:8:19')

In [51]:
pd.DataFrame(da)

                     0
0  2023-01-01 07:18:01
1  2023-01-02 07:18:01
2  2023-01-03 07:18:01
3  2023-01-04 07:18:01
4  2023-01-05 07:18:01
5  2023-01-06 07:18:01
6  2023-01-07 07:18:01
7  2023-01-08 07:18:01
8  2023-01-09 07:18:01
9  2023-01-10 07:18:01
10 2023-01-11 07:18:01
11 2023-01-12 07:18:01
12 2023-01-13 07:18:01
13 2023-01-14 07:18:01
14 2023-01-15 07:18:01
15 2023-01-16 07:18:01
16 2023-01-17 07:18:01
17 2023-01-18 07:18:01
18 2023-01-19 07:18:01
19 2023-01-20 07:18:01
20 2023-01-21 07:18:01
21 2023-01-22 07:18:01
22 2023-01-23 07:18:01
23 2023-01-24 07:18:01
24 2023-01-25 07:18:01
25 2023-01-26 07:18:01
26 2023-01-27 07:18:01
27 2023-01-28 07:18:01
28 2023-01-29 07:18:01
29 2023-01-30 07:18:01

In [75]:
 daa =pd.DataFrame({'date_time':da})

In [76]:
daa

             date_time
0  2023-01-01 07:18:01
1  2023-01-02 07:18:01
2  2023-01-03 07:18:01
3  2023-01-04 07:18:01
4  2023-01-05 07:18:01
5  2023-01-06 07:18:01
6  2023-01-07 07:18:01
7  2023-01-08 07:18:01
8  2023-01-09 07:18:01
9  2023-01-10 07:18:01
10 2023-01-11 07:18:01
11 2023-01-12 07:18:01
12 2023-01-13 07:18:01
13 2023-01-14 07:18:01
14 2023-01-15 07:18:01
15 2023-01-16 07:18:01
16 2023-01-17 07:18:01
17 2023-01-18 07:18:01
18 2023-01-19 07:18:01
19 2023-01-20 07:18:01
20 2023-01-21 07:18:01
21 2023-01-22 07:18:01
22 2023-01-23 07:18:01
23 2023-01-24 07:18:01
24 2023-01-25 07:18:01
25 2023-01-26 07:18:01
26 2023-01-27 07:18:01
27 2023-01-28 07:18:01
28 2023-01-29 07:18:01
29 2023-01-30 07:18:01